# <span style="color:red">**Explore_a_db**</span>

    1.Import libraries

In [1]:
import pandas as pd

    2.Import dataset

In [2]:
df = pd.read_csv('src/chipotle.csv')
df

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...,...
4617,4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

    3.Look at the 10 first rows in the dataset

In [3]:
df.head(10)

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price
0,0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,1,Izze,[Clementine],$3.39
2,2,1,1,Nantucket Nectar,[Apple],$3.39
3,3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,6,3,1,Side of Chips,NaN,$1.69
7,7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

    4.What is the shape of the dataset ?

In [4]:
df.shape

(4622, 6)

    5.Display all the columns of our dataset

In [5]:
df.columns

Index(['Unnamed: 0', 'order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

    6.What is the most ordered item?
        Indication: we will use GROUP BY & Sort_values()

In [6]:
df.groupby(['item_name']).sum().sort_values(by='quantity',ascending=False)

                                       Unnamed: 0  order_id  quantity
item_name
Chicken Bowl                              1779909    713926       761
Chicken Burrito                           1238217    497303       591
Chips and Guacamole                       1121773    449959       506
Steak Burrito                              817795    328437       386
Canned Soft Drink                          759990    304753       351
Chips                                      518704    208004       230
Steak Bowl                                 482721    193752       221
Bottled Water                              439354    175944       211
Chips and Fresh Tomato Salsa               250144    100419       130
Canned Soda                                189915     76396       126
Chicken Salad Bowl                         292292    117104       123
Chicken Soft Tacos                         244891     98395       120
Side of Chips                              211009     84769       110
Veggie Burrito                             201321     80962        97
Barbacoa Burrito                           185979     74718        91
Veggie Bowl                                180046     72270        87
Carnitas Bowl                              156599     62742        71
Barbacoa Bowl                              134264     53972        66
Carnitas Burrito                           128611     51652        60
Steak Soft Tacos                           125012     50177        56
6 Pack Soft Drink                          130318     52322        55
Chips and Tomatillo Red Chili Salsa        113585     45556        50
Chicken Crispy Tacos                       118393     47382        50
Chips and Tomatillo Green Chili Salsa      102435     41170        45
Carnitas Soft Tacos                         93766     37673        40
Steak Crispy Tacos                          89408     35818        36
Chips and Tomatillo-Green Chili Salsa       54211     21826        33
Steak Salad Bowl                            73953     29590        31
Nantucket Nectar                            54403     21814        29
Chips and Tomatillo-Red Chili Salsa         45650     18344        25
Barbacoa Soft Tacos                         46454     18725        25
Chips and Roasted Chili Corn Salsa          37152     14999        23
Izze                                        26280     10587        20
Veggie Salad Bowl                           43124     17303        18
Chips and Roasted Chili-Corn Salsa          43554     17462        18
Barbacoa Crispy Tacos                       13825      5613        12
Barbacoa Salad Bowl                         24161      9708        10
Chicken Salad                               26125     10465         9
Carnitas Crispy Tacos                       14567      5868         8
Veggie Soft Tacos                           13737      5520         8
Burrito                                      3734      1550         6
Veggie Salad                                18164      7265         6
Carnitas Salad Bowl                         16710      6693         6
Bowl                                         1118       472         4
Steak Salad                                  5811      2362         4
Salad                                        2829      1150         2
Crispy Tacos                                 1041       434         2
Chips and Mild Fresh Tomato Salsa             674       279         1
Carnitas Salad                               3750      1500         1
Veggie Crispy Tacos                          1653       668         1

    7.How many items were ordered from Chipotle in total?

In [7]:
df['quantity'].sum()

4972

    8.How much revenue has Chipotle made?

A. Convert item_price to a decimal number. 1. Look at dataset [ item_price ], what do you see? 2. Let's find a way to get that $ out of our way. We can do that by using str 3. Let's now convert the series to float instead of string

In [8]:
df.item_price

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: item_price, Length: 4622, dtype: object

In [9]:
df['item_price'] = df.item_price.str.replace('$','')
df['item_price']

C:\Users\CHAFFA~1\AppData\Local\Temp/ipykernel_4608/2820094968.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['item_price'] = df.item_price.str.replace('$','')

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
         ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: object

In [10]:
df["item_price"]= df.item_price.astype(float)
df.dtypes

Unnamed: 0              int64
order_id                int64
quantity                int64
item_name              object
choice_description     object
item_price            float64
dtype: object

B. Multiply the quantity sold by the price of the item.

In [11]:
df['revenue']=df['item_price']*df['quantity']
df.tail()

,Unnamed: 0,order_id,quantity,item_name,choice_description,item_price,revenue
4617,4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75,11.75
4618,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75,11.75
4619,4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25,11.25
4620,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75,8.75
4621,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75,8.75

C. Add it all up, how much do you find?

D. Round to two decimal places. #We can use the Series.round() function.

In [12]:
total_amount = round((df['revenue'].sum()),2)
total_amount
#

39237.02

    9.What is the average revenue per order?

In [13]:
df1=df.groupby(['order_id']).sum()
df1.mean()

Unnamed: 0    5822.863141
quantity         2.711014
item_price      18.811429
revenue         21.394231
dtype: float64


# <span style="color:red">**House market**</span>

    1.Import libraries

In [82]:
import pandas as pd

    2.Download the four files “superficie.csv” / “nombre_de_sdb.csv” / “nombre_de_chambres.csv” / "house_price.csv"

In [103]:
df1=pd.read_csv('house_market/superficie.csv',header=None)
df1.head(5)

   0      1
0  0  28844
1  1  27667
2  2  14742
3  3  28089
4  4  11713

In [104]:
df2=pd.read_csv('house_market/nombre_de_sdb.csv',header=None)
df2.head(5), df2.shape

(   0  1
 0  0  2
 1  1  1
 2  2  1
 3  3  3
 4  4  1,
 (100, 2))

In [105]:
df3=pd.read_csv('house_market/nombre_de_chambres.csv',header=None)
df3.head(5) , df3.shape

(   0  1
 0  0  1
 1  1  4
 2  2  1
 3  3  4
 4  4  2,
 (100, 2))

In [100]:
df4=pd.read_csv('house_market/house_price.csv')
df4.head(5)

   Unnamed: 0  id  house_price
0           0  14    1918154.0
1           1  30     739142.0
2           2  70    1621938.0
3           3  77    1319862.0
4           4  50     146250.0

    3.Give a column name to the three datasets that don't have a header in the source file

In [106]:
df1.columns=['id', 'surface']
df1.head(5)

   id  surface
0   0    28844
1   1    27667
2   2    14742
3   3    28089
4   4    11713

In [107]:
df2.columns=['id', 'bathrooms']
df2.head(5)

   id  bathrooms
0   0          2
1   1          1
2   2          1
3   3          3
4   4          1

In [108]:
df3.columns=['id', 'rooms']
df3.head(5)

   id  rooms
0   0      1
1   1      4
2   2      1
3   3      4
4   4      2

    4.Make an inner join of these four datasets into a single dataframe.

In [109]:
df = df1.merge(df2, on='id', how='inner').merge(df3,on='id', how='inner').merge(df4,on='id', how='inner')
df.head(10)

   id  surface  bathrooms  rooms  Unnamed: 0  house_price
0   0    28844          2      1          32    1421908.0
1   1    27667          1      4          71    1305091.0
2   2    14742          1      1          65     164373.0
3   3    28089          3      4          88    1441714.0
4   4    11713          1      2          49     108290.0
5   5    28591          3      4          33    1703033.0
6   6    17385          3      3          54     340284.0
7   7    26197          2      3          42    1236645.0
8   8    17611          2      3          20     257405.0
9   9    12841          3      3          99     157433.0

    5.What is the average surface area of the houses in our dataset?

In [110]:
surfaceavg = df['surface'].mean()
print(round(surfaceavg,2))

20439.77

    6.What is the median and average number of rooms?

In [111]:
roomedian = df['rooms'].median()
roomavg = round((df['rooms'].mean()),2)
print("The average number of room is {}, and the median number is {}.".format(roomavg,roomedian))

The average number of room is 2.42, and the median number is 2.0.

    7.What is the average cost of a house?

In [112]:
costavg = round((df['house_price'].mean()),2)
costavg

767747.87

    8.What is the average cost of a house, depending on the number of rooms it has?

In [113]:
houseavg = df.groupby('rooms')['house_price'].mean()
houseavg

rooms
1    980774.869565
2    642086.258065
3    645904.592593
4    888045.631579
Name: house_price, dtype: float64

In [114]:
df.dtypes

id               int64
surface          int64
bathrooms        int64
rooms            int64
Unnamed: 0       int64
house_price    float64
dtype: object

    9.The average cost per room doesn't tell us much. Let's try to categorize by size.
    Create a new column in your dataset that we'll call home_size.

Create three categories that respectively correspond to:

"very large" == "a house larger than 25,000 sqrt_feet"

"large" == "a house between 20,000 and 25,000 sqrt_feet"

"medium" == "a house between 15,000 and 20,000 sqrt_feet"

"small" == "a house between 10,000 and 15,000 sqrt_feet"

"very small" == a house less than 10,000 sqrt_feet"

Fill in the corresponding rows in the house_size column.

In [ ]:
#df['home_size'] = df['surface'].apply(lambda x : x if x > 25000 elif > 20000 eli else 0)

if df['surface'] > 25000:
    df['home_size'] == "very large"
elif df['surface'] < 10000:
    df['home_size'] == "very small"
else:
    df['home_size'] == other